bierner.color-info
bierner.markdown-preview-github-styles
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
donjayamanne.githistory
emeraldwalk.runonsave
eriklynd.json-tools
exiasr.hadolint
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
gruntfuggly.todo-tree
hashicorp.terraform
janisdd.vscode-edit-csv
jinliming2.vscode-go-template
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
naumovs.color-highlight
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
timonwong.shellcheck
vscode-icons-team.vscode-icons
waderyan.gitblame
zxh404.vscode-proto3
