# Brewfile made by dofy

# Lib
brew "gmp"
brew "harfbuzz"
brew "libass"
brew "libassuan"
brew "libomp"
brew "librsvg"
brew "opus"
brew "pango"
brew "pinentry"
brew "pkgconf"
brew "portaudio"
brew "ta-lib"
brew "tesseract"
brew "ttyd"
brew "unbound"

# Fonts
cask "font-roboto-mono-nerd-font"

# Tools

## Core Tools
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "mas"


### SNS
cask "slack"
cask "zoom"

### Browser
cask "firefox@developer-edition"
cask "google-chrome"

### Other Tools
cask "jordanbaird-ice"

## Dev Tools

### Dev Manager
brew "mise"
brew "volta"

### Editor
cask "visual-studio-code"
cask "visual-studio-code@insiders"
mas "Xcode", id: 497799835

### Core
brew "git"
brew "git-lfs"
brew "pinentry-mac"
cask "iterm2"

### Shell
brew "bat"
brew "coreutils"
brew "curl"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "grpcurl"
brew "htop"
brew "jq"
brew "nano"
brew "sheldon"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

### Tools
cask "gitify"
cask "orbstack"
cask "postman"
cask "rancher"
cask "wireshark"

### In Development Tools

#### Language And Stacks
brew "go"

##### QA
brew "actionlint"
brew "ansible-lint"
brew "gofumpt"
brew "golangci-lint"
brew "hadolint"
brew "markdownlint-cli2"
brew "shellcheck"
brew "sqlfluff"
brew "yamlfmt"
brew "yamllint"
