# Brewfile made by dofy

# Fonts
cask "font-roboto-mono-nerd-font"

# Tools

## Core Tools
tap "homebrew/bundle"
tap "homebrew/services"
brew "mas"

## System Tools
cask "raycast"

### SNS
cask "discord"
cask "slack"

### Browser
cask "google-chrome"

## Dev Tools

### Dev Manager
brew "mise"
brew "volta"

### Editor
cask "visual-studio-code"

### Core
brew "git"
brew "git-lfs"
brew "pinentry-mac"
cask "iterm2"

### Shell
brew "bat"
brew "coreutils"
brew "curl"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "grpcurl"
brew "htop"
brew "jq"
brew "nano"
brew "sheldon"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

### Tools
cask "docker"
cask "gitify"

### Support Tools
brew "ansible"

### In Development Tools

#### Language And Stacks
brew "go@1.23"

##### QA
brew "actionlint"
brew "ansible-lint"
brew "gofumpt"
brew "golangci-lint"
brew "hadolint"
brew "markdownlint-cli2"
brew "shellcheck"
brew "sqlfluff"
brew "yamlfmt"
brew "yamllint"

# WIP
tap "bufbuild/buf"
tap "reviewdog/tap"
brew "bufbuild/buf/buf"
brew "clang-format"
brew "protobuf"
brew "reviewdog/tap/reviewdog"
cask "google-cloud-sdk"
