# Brewfile made by dofy

# Lib
brew "gmp"
brew "harfbuzz"
brew "libass"
brew "libassuan"
brew "libomp"
brew "librsvg"
brew "opus"
brew "pango"
brew "pinentry"
brew "pkgconf"
brew "portaudio"
brew "ta-lib"
brew "tesseract"
brew "ttyd"
brew "unbound"

# Fonts
cask "font-roboto-mono-nerd-font"

# Toys
cask "steam"

# Tools

## Core Tools
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "mas"

## System Tools
cask "1password"
cask "battery"
cask "openinterminal"
cask "raycast"

## Usual Tools

### SNS
cask "discord"
cask "notion"
cask "slack"
cask "zoom"
mas "LINE", id: 539883307

### Office
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

### Browser
cask "arc"
cask "brave-browser"
cask "firefox@developer-edition"
cask "google-chrome"
cask "microsoft-edge"
cask "tor-browser"

### Tools creatives
tap "shiron-dev/tap"
tap "voicevox/voicevox"
cask "aivis-speech"
cask "audacity"
cask "gimp"
cask "inkscape"
cask "kicad"
cask "ltspice"
cask "master-pdf-editor"
cask "obs"
cask "vb-cable"
cask "vlc"
cask "voicevox"
mas "DaVinci Resolve", id: 571213070

### Other Tools
cask "betterdisplay"
cask "itsycal"
cask "jordanbaird-ice"
cask "onyx"
cask "timemachinestatus"
cask "utm"
cask "wakatime"
cask "webtorrent"
cask "whisky"
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602

## Dev Tools

### Dev Manager
brew "mise"
brew "volta"

### Editor
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
mas "Xcode", id: 497799835

### Core
brew "git"
brew "git-lfs"
brew "pinentry-mac"
cask "iterm2"

### shell
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
brew "apktool"
brew "arp-scan"
brew "bat"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "grpcurl"
brew "htop"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "nano"
brew "navi"
brew "netcat"
brew "nmap"
brew "parallel"
brew "sheldon"
brew "tree"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"

### Task Runner
tap "go-task/tap"
tap "joerdav/xc"
brew "go-task/tap/go-task"
brew "joerdav/xc/xc"

### Tools
cask "docker"
cask "gitify"
cask "orbstack"
cask "postman"
cask "wireshark"

### Support Tools
tap "ariga/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
brew "ansible"
brew "ariga/tap/atlas"
brew "docker-buildx"
brew "goreleaser/tap/goreleaser"
brew "graphviz"
brew "hashicorp/tap/packer"
brew "mysql-client@8.0"
brew "terraform"
cask "mysqlworkbench"
cask "pgadmin4"

### Service Tools
tap "cloudflare/cloudflare"
brew "awscli"
brew "cloudflared"
cask "google-cloud-sdk"
cask "session-manager-plugin"
cask "tailscale"

### In Development Tools

#### Language And Stacks
tap "bufbuild/buf"
brew "arduino-cli"
brew "bufbuild/buf/buf"
brew "delve"
brew "go"
brew "pipx"
brew "protobuf"
brew "rust"
cask "unity-hub"

##### QA
tap "shyiko/ktlint"
brew "act"
brew "actionlint"
brew "ansible-lint"
brew "gofumpt"
brew "golangci-lint"
brew "hadolint"
brew "infracost"
brew "markdownlint-cli2"
brew "shellcheck"
brew "shyiko/ktlint/ktlint"
brew "sqlfluff"
brew "yamlfmt"
brew "yamllint"
