# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "sdkman/tap"
tap "shyiko/ktlint"
tap "teamookla/speedtest"

# Core Tools
cask "google-chrome"
cask "arc"
cask "1password"
cask "raycast"
cask "rectangle"

# Core Dev Tools
brew "git"
brew "git-lfs"
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "firefox@developer-edition"

# Dev Tools
brew "act"
brew "ansible"
brew "ansible-lint"
brew "arduino-cli"
brew "arp-scan"
brew "cloudflared"
brew "coreutils"
brew "curl"
brew "gnutls"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "pinentry-mac"
brew "jq"
brew "just"
brew "nano"
brew "netcat"
brew "nmap"
brew "peco"
brew "pyenv"
brew "rust"
brew "shellcheck"
brew "stow"
brew "tree"
brew "volta"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "hashicorp/tap/terraform"
brew "sdkman/tap/sdkman-cli"
brew "shyiko/ktlint/ktlint"
brew "teamookla/speedtest/speedtest"
cask "arduino-ide"
cask "postman"
cask "utm"
cask "wireshark"
cask "astah-professional"

# Tools Internet
cask "slack"
cask "discord"
cask "notion"
cask "tor-browser"

# Tools Audio/Video
cask "audacity"
cask "vlc"

# Tools
cask "whisky"
