# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "sdkman/tap"
tap "shyiko/ktlint"
tap "teamookla/speedtest"
tap "voicevox/voicevox"
tap "ariga/tap"
tap "bufbuild/buf"
tap "grishka/grishka"
tap "joerdav/xc"

# Core Tools
brew "mas"
cask "google-chrome"
cask "arc"
cask "1password"
cask "raycast"
cask "rectangle"
cask "openinterminal"
cask "battery"

# Core Dev Tools
brew "git"
brew "git-lfs"
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "firefox@developer-edition"
cask "jetbrains-toolbox"
cask "gitify"
mas "Xcode", id: 497799835

# Dev Tools
brew "act"
brew "ansible"
brew "ansible-lint"
brew "arduino-cli"
brew "arp-scan"
brew "cloudflared"
brew "coreutils"
brew "curl"
brew "gnutls"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "pinentry-mac"
brew "jq"
brew "just"
brew "nano"
brew "netcat"
brew "nmap"
brew "peco"
brew "pyenv"
brew "rust"
brew "shellcheck"
brew "stow"
brew "tree"
brew "volta"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "rbenv"
brew "hashicorp/tap/terraform"
brew "sdkman/tap/sdkman-cli"
brew "shyiko/ktlint/ktlint"
brew "teamookla/speedtest/speedtest"
brew "actionlint"
brew "awscli"
brew "docker-buildx"
brew "gawk"
brew "golangci-lint"
brew "graphviz"
brew "grpcurl"
brew "hadolint"
brew "infracost"
brew "markdownlint-cli2"
brew "mysql-client@8.0"
brew "protobuf"
brew "sqlfluff"
brew "thefuck"
brew "yt-dlp"
brew "ariga/tap/atlas"
brew "bufbuild/buf/buf"
brew "hashicorp/tap/packer"
brew "joerdav/xc/xc"
cask "google-cloud-sdk"
cask "master-pdf-editor"
cask "mysqlworkbench"
cask "pgadmin4"
cask "session-manager-plugin"
cask "arduino-ide"
cask "postman"
cask "utm"
cask "wireshark"
cask "amazon-q"
cask "tailscale"
cask "postman"
cask "raspberry-pi-imager"
cask "unity-hub"

# Tools Internet
cask "slack"
cask "discord"
cask "notion"
cask "tor-browser"
cask "zoom"
mas "LINE", id: 539883307

# Tools creatives
cask "audacity"
cask "vlc"
cask "gimp"
cask "inkscape"
mas "DaVinci Resolve", id: 571213070

# Tools
cask "whisky"
cask "appcleaner"
cask "android-file-transfer"
cask "betterdisplay"
cask "obs"
cask "webtorrent"
cask "voicevox"
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602
mas "AmorphousDiskMark", id: 1168254295

# Office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
