42crunch.vscode-openapi
alexisvt.flutter-snippets
amiralizadeh9480.cpp-helper
bierner.color-info
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
cschlosser.doxdocgen
csstools.postcss
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
docker.docker
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
emeraldwalk.runonsave
eriklynd.json-tools
esbenp.prettier-vscode
exiasr.hadolint
figma.figma-vscode-extension
firefox-devtools.vscode-firefox-debug
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.geminicodeassist
gruntfuggly.todo-tree
hashicorp.terraform
janisdd.vscode-edit-csv
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jinliming2.vscode-go-template
mariusalchimavicius.json-to-ts
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-ceintl.vscode-language-pack-ja
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-serial-monitor
ms-vscode.vscode-speech
ms-vscode.vscode-speech-language-pack-ja-jp
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naumovs.color-highlight
orta.vscode-jest
pmneo.tsimporter
postman.postman-for-vscode
redhat.ansible
redhat.vscode-yaml
ritwickdey.liveserver
rust-lang.rust-analyzer
rvest.vs-code-prettier-eslint
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
shopify.ruby-extensions-pack
shopify.ruby-lsp
simonsiefke.svg-preview
sorbet.sorbet-vscode-extension
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
typespec.typespec-vscode
vadimcn.vscode-lldb
vitest.explorer
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
waderyan.gitblame
wakatime.vscode-wakatime
wholroyd.jinja
yzane.markdown-pdf
yzhang.markdown-all-in-one
zignd.html-css-class-completion
zxh404.vscode-proto3

